Repository: abib-devok/sunu_moulinSMARTECO
Catalog: sunu_moulin_smarteco/lib/l10n/app_*.arb
Languages: fr

# languageSelectionTitle
source: Choose your language
fr: Choisissez votre langue

source: French
fr: Français

source: English
fr: Anglais

# continueButton
source: Continue
fr: Continuer

# welcomeMessage
source: Welcome to Sunu Moulin
fr: Bienvenue à Sunu Moulin

# loginPrompt
source: Choose how to log in
fr: Choisissez comment vous connecter

source: Scan QR
fr: Scanner QR

source: Enter PIN
fr: Entrer PIN

source: Guest Access
fr: Accès Invité

# needHelp
source: Need Assistance?
fr: Besoin d'assistance ?

# connectToMill
source: Connect to a Mill
fr: Connecter à un Moulin

source: Enabled
fr: Activé

source: Nearby Mills
fr: Moulins à Proximité

# scanForMills
source: Scan
fr: Scanner

source: Available
fr: Disponible

source: In Use
fr: En cours d'utilisation

source: Offline
fr: Hors ligne

source: Connect
fr: Connecter

# scanning
source: Scanning for more mills...
fr: Recherche d'autres moulins...

# configureMilling
source: Configure Your Milling
fr: Configurez Votre Mouture

source: Step 1 of 3
fr: Étape 1 sur 3

# chooseCereal
source: 1. Choose your Cereal
fr: 1. Choisissez votre Céréale

# selectFineness
source: 2. Select the Fineness
fr: 2. Sélectionnez la Finesse

# setQuantity
source: 3. Set the Quantity (kg)
fr: 3. Réglez la Quantité (kg)

source: Medium
fr: Moyenne

source: Coarse
fr: Grosse

# voiceHint
source: Or, tap the mic and say "Mill 5kg of fine mil."
fr: Ou, tapez sur le micro et dites "Moudre 5kg de mil fin."

source: Confirm Milling
fr: Confirmer la Mouture

# millControlTitle
source: Mill 01 - Connected
fr: Moulin 01 - Connecté

# millStarted
source: Milling started successfully.
fr: Mouture démarrée avec succès.

source: Milling...
fr: Mouture...

source: Temperature
fr: Température

source: Progress
fr: Progression

source: Normal
fr: Normale

source: Start Milling
fr: Démarrer

source: Stop
fr: Arrêter

# historyTitle
source: Milling History
fr: Historique des Moutures

# searchHint
source: Search by date or ID...
fr: Rechercher par date ou ID...

source: Export History
fr: Exporter l'Historique

# sessionDetails
source: Total Weight: {weight} kg | Duration: {duration} min
fr: Poids total: {weight} kg | Durée: {duration} min

# statusFailed
source: Status: Failed | Duration: {duration} min
fr: Statut: Échec | Durée: {duration} min

# notImplemented
source: Feature not yet implemented.
fr: Fonctionnalité pas encore implémentée.
